#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lightsail_instance.amplifica will be created
  + resource "aws_lightsail_instance" "amplifica" {
      + arn                = (known after apply)
      + availability_zone  = "us-east-2a"
      + blueprint_id       = "ubuntu_20_04"
      + bundle_id          = "micro_2_0"
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + name               = "amplifica_server"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + tags               = {
          + "poc" = "true"
        }
      + tags_all           = {
          + "poc" = "true"
        }
      + user_data          = <<-EOT
            #!/bin/bash
            
            ##############################################################################
            # INSTALLING R, RSTUDIO SERVER AND ALL DEPENDENCIES
            ##############################################################################
            
            # Add a swap file to prevent build time OOM errors
            fallocate -l 16G /swapfile
            mkswap /swapfile
            swapon /swapfile
            echo '/swapfile none swap sw 0 0' | sudo tee -a /etc/fstab
            echo "vm.swappiness=10" >> /etc/sysctl.conf
            sysctl vm.swappiness=10
            
            sysctl vm.vfs_cache_pressure=50
            echo "vm.vfs_cache_pressure=50" >> /etc/sysctl.conf
            
            export DEBIAN_FRONTEND=noninteractive
            
            apt update
            apt upgrade -yqq
            apt autoremove -yqq
            apt install --no-install-recommends -yqq \
                software-properties-common \
                dirmngr \
                build-essential \
                zlib1g-dev
            
            apt-key adv \
                --keyserver keyserver.ubuntu.com \
                --recv-keys E298A3A825C0D65DFD57CBB651716619E084DAB9
            wget -qO- https://cloud.r-project.org/bin/linux/ubuntu/marutter_pubkey.asc | \
                sudo tee -a /etc/apt/trusted.gpg.d/cran_ubuntu_key.asc
            add-apt-repository "deb https://cloud.r-project.org/bin/linux/ubuntu $(lsb_release -cs)-cran40/"
            
            # Install R-base
            apt update
            apt install --no-install-recommends r-base -yqq
            
            # Install r-server
            wget https://download2.rstudio.org/server/bionic/amd64/rstudio-server-2021.09.1-372-amd64.deb -O /tmp/rstudio_server_install.deb
            apt install /tmp/rstudio_server_install.deb -yqq
            
            # Install shiny package
            R --no-save -e "install.packages('shiny', repos='https://cran.rstudio.com/')"
            
            # Install shiny-server
            wget https://download3.rstudio.org/ubuntu-14.04/x86_64/shiny-server-1.5.17.973-amd64.deb -O /tmp/shiny_server_install.deb
            apt install /tmp/shiny_server_install.deb -yqq
            
            CPUS=$(nproc)
            if [[ "${CPUS}" != 1 ]]; then
                CPUS=$(( CPUS - 1 ))
            fi
            
            # Install additional packages
            cat << EOF > r_install_packages.R
            update.packages(ask=FALSE,
                Ncpus=${CPUS},
                lib="/usr/local/lib/R/site-library",
                checkBuilt=TRUE,
                quiet=TRUE,
                repos = "http://cran.us.r-project.org")
            
            install.packages(lib="/usr/local/lib/R/site-library",
            c(
                "R.utils",
                "stringr",
                "testthat",
                "tidyverse"
                ),
                Ncpus=${CPUS},
                ask=FALSE,
                checkBuilt=TRUE,
                quiet=TRUE,
                repos = "http://cran.us.r-project.org"
            )
            
            q()
            EOF
            chmod +rw r_install_packages.R
            R --no-save < r_install_packages.R
            
            echo "www-port=80" > /etc/rstudio/rserver.conf
            echo "www-thread-pool-size=${CPUS}" >> /etc/rstudio/rserver.conf
            echo "session-timeout-minutes=0" >> /etc/rstudio/rsession.conf
            
            systemctl restart rstudio-server.service
            
            # Add our users
            # These passwords were generated using:
            # openssl passwd -1 <PLAIN PASSOWRD>
            # or
            # perl -e 'print crypt("<MY_PASSWORD>", "password"), "\n"'
            useradd -m -d "/home/diraol" -p pa4j2BsyHVrkI -s /bin/bash diraol
            
            mkdir -p "/home/diraol/.ssh"
            
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDGLiW95QE2rINsV6TdWQprv9jRGj5ZTbahtyJYJ4JMgm/LK1ETsCJpXcw9FmTmzFHXj76rho8B/fHhU3lUgF3mZVc2M4OXwbFRSgZj3Yd7AYFwB4EhX6/5oqguySVipIUC0a6vc6LEuLksNe72yRJKd57XIlePg6v0g/YELMo+VYiMF3Y71/DW+Y7XZpsL7+7cx4lyYgJwL+w6pBkkCEC6A0B7yx1QQYpxVZoMsmqEQSqJe+fcMtu8kJzem4QtcOj+N/OJ/yl3dNuILDUG1Dj4IsJTQt516TWzmhN905F2x84CHdlzqtmzT/1rVFqdjY13k0mx3uFSpVmZF9ww8dRf diraol@diraol.eng.br - GandhiSSD" >> "/home/diraol/.ssh/authorized_keys"
            echo "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" >> "/home/diraol/.ssh/authorized_keys"
            chown diraol:diraol "/home/diraol/.ssh/authorized_keys"
            
            su - diraol R < r_install_packages.R
        EOT
      + username           = (known after apply)
    }

  # aws_lightsail_instance_public_ports.amplifica will be created
  + resource "aws_lightsail_instance_public_ports" "amplifica" {
      + id            = (known after apply)
      + instance_name = "amplifica_server"

      + port_info {
          + cidrs     = (known after apply)
          + from_port = 22
          + protocol  = "tcp"
          + to_port   = 22
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 3838
          + protocol  = "tcp"
          + to_port   = 3838
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 443
          + protocol  = "tcp"
          + to_port   = 443
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 8787
          + protocol  = "tcp"
          + to_port   = 8787
        }
    }

  # aws_lightsail_static_ip.amplifica will be created
  + resource "aws_lightsail_static_ip" "amplifica" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + ip_address   = (known after apply)
      + name         = "amplifica"
      + support_code = (known after apply)
    }

  # aws_lightsail_static_ip_attachment.amplifica will be created
  + resource "aws_lightsail_static_ip_attachment" "amplifica" {
      + id             = (known after apply)
      + instance_name  = (known after apply)
      + ip_address     = (known after apply)
      + static_ip_name = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @diraol, Action: `pull_request`*